[
  {
    "value": "BT1101",
    "label": "BT1101 Introduction to Business Analytics",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "True",
    "GEPillar": "GEA",
    "hasMCQ": "True",
    "desc": "This course provides students with an introduction to the fundamental concepts and tools needed to understand the emerging role of business analytics and data science applications in business and non-profit organisations. Students will learn how to apply basic business analytics and data science/analytics tools (such as R) to large real-life datasets in different contexts, and how to effectively use and interpret analytic models and results for making better and more well-informed business decisions. This course will provide both the organisational and technical aspects of business analytics and serves to provide students with a broad overview of how and why business analytics can be implemented in organisations, the various approaches and techniques that could be adopted for different organisational objectives and issues."
  },
  {
    "value": "DSA1101",
    "label": "DSA1101 Introduction to Data Science",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "True",
    "GEPillar": "GEA",
    "hasMCQ": "True",
    "desc": "The abundance of data being harvested from various sectors of today’s society increases the demand for skilled data science practitioners. This course introduces foundational data science concepts to prepare students for tackling real-world data analytic challenges. Major topics include basic concepts in probability and statistics, data manipulation, supervised and unsupervised learning, model validation and big data analysis, alongside special topics discussed in guest lectures delivered by practicing data scientists from government and industry. Throughout the course, students will learn fundamental R programming skills to implement and apply the data science methods in motivating realworld case studies from diverse fields."
  },
  {
    "value": "DSE1101",
    "label": "DSE1101 Introductory Data Science for Economics",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEA",
    "hasMCQ": "False",
    "desc": "The vast amount of data generated by economic activities such as consumption, production and investment increases the demand for data science practitioners with a knowledge of economic analysis. This course introduces foundational data science concepts to prepare students for tackling data analytic challenges in economics and related fields such as finance, public policy and society. Topics include basic concepts in probability and statistics, data manipulation, supervised and unsupervised learning, model validation and big data analysis. Students will learn fundamental R programming skills to implement and apply the data science methods in motivating real-world case studies from economics and related fields."
  },
  {
    "value": "IE1111R",
    "label": "IE1111R Industrial and Systems Engineering Principles and Practice I",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEA",
    "hasMCQ": "False",
    "desc": "This course introduces first year industrial and systems engineering students to various problems in this field and how they can be analyzed and tackled through mathematical modelling, data analytics, simulation and quantitative decision making. By working on a series of carefully curated problems, students gain an appreciation for the challenges faced when tackling large complex problems under uncertainty and the role that data can play in addressing them."
  },
  {
    "value": "SPH1904",
    "label": "SPH1904 Data Literacy for Healthcare",
    "canSU": "False",
    "passFail": "True",
    "hasGroupProject": "False",
    "GEPillar": "GEA",
    "hasMCQ": "False",
    "desc": "Healthcare is becoming increasingly evidence-based and data-driven. To understand and use scientific evidence for evidence-based practice, a clear understanding of the underlying epidemiological and biostatistical concepts is necessary to evaluate clinical evidence critically. This course will introduce students to the principles in appraising healthcare data and literature critically and in reviewing sources of bias in common study designs. The course offers opportunities for students to apply these concepts when providing evidence-based recommendations to their patients. It will also draw parallels in using these skills in non-healthcare settings to demonstrate the transferability of skills."
  },
  {
    "value": "ST1131",
    "label": "ST1131 Introduction to Statistics and Statistical Computing",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "True",
    "GEPillar": "GEA",
    "hasMCQ": "True",
    "desc": "This course introduces students to basic concepts and methods of statistics that will enable them to perform appropriate data analyses to uncover meaningful insights. The statistical software R is taught alongside the material to introduce statistical computing. Students will learn to load raw data, make numerical and graphical summaries of data, and conduct various estimation and testing procedures. Topics include programming in R, descriptive statistics, concepts of probability, random variables and probability distributions, sampling distribution, statistical estimation, hypothesis testing, linear regression, and applications to real-world problems."
  },
  {
    "value": "TCX2002",
    "label": "TCX2002 Introduction to Business Analytics",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEA",
    "hasMCQ": "False",
    "desc": "This course provides students with an introduction to the fundamental concepts and tools needed to understand the emerging role of business analytics and data science applications in business and non-profit organisations. Students will learn how to apply basic business analytics and data science/analytics tools (such as R) to large real-life datasets in different contexts, and how to effectively use and interpret analytic models and results for making better and more well-informed business decisions. This course will provide both the organisational and technical aspects of business analytics and serves to provide students with a broad overview of how and why business analytics can be implemented in organisations, the various approaches and techniques that could be adopted for different organisational objectives and issues."
  },
  {
    "value": "GEA1000",
    "label": "GEA1000 Quantitative Reasoning with Data",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "True",
    "GEPillar": "GEA",
    "hasMCQ": "True",
    "desc": "This course aims to equip undergraduate students with essential data literacy skills to analyse data and make decisions under uncertainty. It covers the basic principles and practice for collecting data and extracting useful insights, illustrated in a variety of application domains. For example, when two issues are correlated (e.g., smoking and cancer), how can we tell whether the relationship is causal (e.g., smoking causes cancer)? How can we deal with categorical data? Numerical data? What about uncertainty and complex relationships? These and many other questions will be addressed using data software and computational tools, with real-world data sets. Short Syllabus: The PPDAC cycle (Spiegelhalter, D., 2019, The Art of Statistics; MacKay, R.J., R.W. Oldford, 2000, “Scientific Method, Statistical Method and the Speed of Light,” Statistical Science) will be used as a framework to highlight and demonstrate the process of dealing with and making sense of data. The course will consist of four chapters, broadly described below. Getting data: collection/sampling, experiments/observational studies, data cleaning/recoding, interpreting summary statistics (mode, mean, quartiles, standard deviation, etc.). Categorical data analysis: bar plots, contingency tables, rates/ratios, association, Simpson’s Paradox. Dealing with numerical data: histograms, boxplots, scatter plots, correlation, ecological and atomistic fallacies, simple linear regression. Statistical Inference: probability, conditional probability, prosecutor's fallacy, base rate fallacy, conjunction fallacy, understanding hypothesis tests, interpreting confidence intervals, learning about a population based on a sample, simple simulation. Exploratory data analysis (EDA) will be incorporated extensively into the content. Students will appreciate that even simple plots and contingency tables can give them valuable insights about data. There will be an emphasis on using suitable real world data sets as motivating examples to introduce content and through the process of problem solving, elucidate techniques/materials in the syllabus."
  },
  {
    "value": "GEA1000N",
    "label": "GEA1000N Quantitative Reasoning with Data",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEA",
    "hasMCQ": "False",
    "desc": "This course aims to equip undergraduate students with essential data literacy skills to analyse data and make decisions under uncertainty. It covers the basic principles and practice for collecting data and extracting useful insights, illustrated in a variety of application domains. For example, when two issues are correlated (e.g., smoking and cancer), how can we tell whether the relationship is causal (e.g., smoking causes cancer)? How can we deal with categorical data? Numerical data? What about uncertainty and complex relationships? These and many other questions will be addressed using data software and computational tools, with real-world data sets."
  }
]