[
  {
    "value": "GEC1000",
    "label": "GEC1000 Globalisation and New Media",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course offers students an introduction into the role of new communication technologies in the context of globalization. We will explore various aspects of global communication flows including the global reach of new media and its consequences, global and transnational timesharing and workflows, the role of new media in global and local politics, and the potential of new and traditional communication channels in the context of various forms of activism and communication for social change. The role of culture in global communication and ways in which cultural processes shape and are shaped by the landscape of globalization will be emphasized."
  },
  {
    "value": "GEC1001",
    "label": "GEC1001 Chinese Music, Language and Literature (In English)",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course explores the complex relationships underlying Chinese music, language and literature. It focuses on Chinese music from the perspective of popular music produced in the People’s Republic of China, Hong Kong, Taiwan and Singapore. These four economies have developed different strands of popular music in Mandarin and various Chinese dialects, due to different linguistic and ideological environments. Students will learn how Chinese popular music draws upon the aesthetics of Chinese literature and traditional Chinese music, and how the music has hybridised influences from foreign musical genres, thus expressing different versions of “Chineseness”."
  },
  {
    "value": "GEC1002",
    "label": "GEC1002 Nations & Nationalism in South Asia",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course examines the role which nationalism has played in the formation and political development of the nations and states of South Asia. It examines nationalist forces in anti-colonial struggles, in post-colonial state formation and in contemporary political developments. It will be of relevance to students with an interest in political developments in Asia, with particular reference to forms of nationalism and nation-building"
  },
  {
    "value": "GEC1003",
    "label": "GEC1003 Pirates, Oceans and The Maritime World",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "Piracy, understood broadly as violence or crime at sea, is a present day phenomenon and yet one which has a history spanning centuries and across all the oceans of the world. From pirates to privateers, corsairs to raiders, maritime predators take various names and forms. This course explores the history of pirates and piracy. By examining case studies from the 1400s onwards and by placing pirates into the context of oceanic history and maritime studies, students will be able to demystify the popular images often associated with pirates."
  },
  {
    "value": "GEC1004",
    "label": "GEC1004 Samurai, Geisha, Yakuza as Self or Other",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course is about learning to recognize and see beyond stereotypes in media by examining cultural icons from Japan's past and present. We will examine samurai, geisha, yakuza, and ninja as they appear in popular culture (film, anime and manga), and compare with historical record. Students will gain a richer understanding of the 'realities' behind such icons, and will be equipped to challenge stereotypes of Japan presented by journalism, popular culture, and the humanistic and social sciences. Ultimately such discovery will lead students to question their own knowledge of self and other."
  },
  {
    "value": "GEC1005",
    "label": "GEC1005 Cultural Borrowing: Japan And China",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "Humans have always actively borrowed from other cultures. Such borrowing is a creative process which influences aspects of life ranging from basic material needs to aesthetic appreciation. Often, however, cultural borrowing is labelled as simple imitation. This results in cultural stereotypes that impede understanding of other cultures. Using Chinese and Japanese cultural borrowings as illustration, this course teaches second and third year students to analyse the creative process of cultural exchange. By developing theoretical perspectives from the study of China and Japan, students will learn about exchanges among culture in general."
  },
  {
    "value": "GEC1006",
    "label": "GEC1006 Understanding Consumption",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "True",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "Consumption has come to dominate our lives, is driving economies, yet also endangering the future of our planet. This course asks questions about consumption from multiple perspectives, such as how did consumption assume its prominent place, how do economists rationalise consumption, how do companies use behavioural models to craft marketing strategies, whether consumption is good or bad for society or the individual, or whether consumers need to be protected. Participants in this course will explore how different disciplines approach such questions and will have the opportunity to reflect on their own consumption practices and impact on the social and physical environment."
  },
  {
    "value": "GEC1007",
    "label": "GEC1007 Geopolitics: Geographies of War & Peace",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This is cross-Faculty course aimed at introducing Geopolitics to a broad range of students. The course is designed to be as engaging and interactive as possible: utilising various multi-media tools, including documentary clips, news media, filmic resources, popular journals and magazines. Not surprisingly, the course has a very lively section on Popular Geopolitics. In addition, we introduce students to the interactions of geopolitics and political space through detailed examination of different geopolitical eras and codes, specifically: Cold War Geopolitics and the Human Landscapes of Southeast Asia: and the so-called \"Global War on Terror\"."
  },
  {
    "value": "GEC1008",
    "label": "GEC1008 Exploring Chinese Cinema: Shanghai-Hong Kong-Singapore",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "Studies on cinema offer an important perspective for understanding human cultures. This course explores Chinese-language film history from the 1930s to the present through examining some key genres of films made by major filmmakers from China, Hong Kong, Singapore and Taiwan, including opera, musical, action and youth films. Special attention will be paid to the socio-cultural condition of their production, distribution, exhibition and consumption, as well as larger regional cultural connections of these four places. The course will be taught in English."
  },
  {
    "value": "GEC1009",
    "label": "GEC1009 Drugs and Society",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "The aim of this course is to impart an appreciation of the use of drugs in relation to the cultural and social environment of societies past and present. How drugs are employed today, watershed \"drug\" discoveries and their impact on society (for example contraceptives, antibiotics, vaccines, psychopharmacological agents), the issue of drug use in sports, \"social\" drugs and the \"pill for every ill\" syndrome will be discussed. Particular attention will be paid to “controversial” drug-related societal issues within each topic. For example, the role of pharmaceutical industry will be examined to determine if the tendency to “bash” big Pharma is justified or if decriminalization of drug use will be a more effective means of curtailing drug abuse. One of the components in this course requires students to objectively evaluate such issues and articulate their stand in an audio-visual presentation."
  },
  {
    "value": "GEC1010",
    "label": "GEC1010 Clean Energy and Storage",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "Modern civilization, which on the one hand boasts of having discovered the behaviour of subatomic particles, has also to its credit the impending intensified energy crisis and global warming. The urgent need to address these challenges has now become obvious. The course will acquaint students with the role of scientific development towards understanding the current global energy crisis and global warming. Emphasis will be given on how scientific progress has helped us in understanding the principle and development of various clean energy and storage technologies, their potential and applicability in present day scenarios and in shaping future energy systems."
  },
  {
    "value": "GEC1011",
    "label": "GEC1011 Microbes Which Changed Human History",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "The primary aim of the module is to introduce students to the nature of infectious diseases and their impact on human activities. At the end of the module, students will be able to understand the interactions between microorganisms and human, and the position and role of human in the living world."
  },
  {
    "value": "GEC1012",
    "label": "GEC1012 Understanding Globalisation",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course proposes to examine the processes of globalization and seeks to provide a deeper understanding of it. The world is globalizing both culturally and economically. We need to ask whether this process is creating a single world without borders or intensifying cultural differences between societies. By discussing various trends of the interdependent world, the course helps us in understanding the various processes of globalization. Since the processes of globalization involve societal, cultural, technological, political, and economic processes, we will take an inter-disciplinary framework in understanding this diverse experience. The course will specifically highlight the problems and prospects of the contemporary world."
  },
  {
    "value": "GEC1013",
    "label": "GEC1013 World Religions",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "True",
    "desc": "This course offers an introductory survey of major religious traditions of the world, with specific Page 12 of 141 focus on Hinduism, Buddhism, Confucianism, Daoism, Judaism, Christianity, and Islam. We will examine the historical development of each tradition, along with its sacred texts, basic philosophical ideas, patterns of ritual and worship, and specialized institutions Our goal is to provide an objective understanding of each faith tradition on its own terms, and secondarily, to explore how religion is relevant to contemporary social, political and cultural issues. This is an introductory course which presumes no prior expertise in religious studies."
  },
  {
    "value": "GEC1014",
    "label": "GEC1014 Social and Cultural Studies Through Music",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course introduces music not only as a sonic matter, but more pertinently as a human, socio-cultural phenomenon. Through lectures, reading and listening assignments, and interactive music-making experience, students will learn how music works, why people listen to and make music, what its roles are in a society, and how these considerations vary across different cultures. The course introduces a variety of musical styles (e.g. folk, art, and popular music) and cultures that represent an enormous wealth of human experience. At the end of the course the students will have access to a much wider variety of music to listen to, participate in, enjoy and understand."
  },
  {
    "value": "GEC1015",
    "label": "GEC1015 Public Health in Action",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "True",
    "GEPillar": "GEC",
    "hasMCQ": "True",
    "desc": "How does public health intersect with various disciplines to enhance community well-being? This interdisciplinary course introduces the field of public health, highlighting its distinct role from clinical medicine and its collaborative approach to complex health issues. You will explore topics such as health promotion, disease prevention, and global health through an interdisciplinary lens, incorporating insights from social sciences, natural sciences, mathematics, economics and political sciences. Real-world case studies will demonstrate the interplay between biological, environmental, social, and economic factors affecting health outcomes. The course emphasises applying public health frameworks to understand the design, implementation, and evaluation of health interventions. You will see how theories and methods from various disciplines converge to address public health challenges and improve population health. Collaborative learning is a key component, with group projects that simulate real-world public health scenarios. These projects will encourage you to integrate diverse perspectives, develop innovative solutions, and communicate effectively within interdisciplinary teams. By the end of the course, you will gain a thorough understanding of how interdisciplinary approaches are vital for addressing complex public health issues and be prepared to apply these methods in your future practice."
  },
  {
    "value": "GEC1016",
    "label": "GEC1016 Plants and Society",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "True",
    "desc": "How are human beings and plants interdependent? How did plants shape the planet Earth to one that is suitable for life as we know it? Such topics will be examined to deepen our appreciation of the roles played by plants in the progress of civilizations and cultures from both historic perspective and continuing impact on society. The discussion topics, written and oral presentations will include plants as sources of food, clothing, shelter, medicine. There will be talks by guests from local industry, along with team projects by students to enrich their awareness of the deep coexistence of plants and society."
  },
  {
    "value": "GEC1017",
    "label": "GEC1017 Film Art and Human Concerns",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "Can movies engage with serious concerns? Through the close study of films by great directors, this course explores how film as an artistic medium can be used to engage with significant socio-cultural and existential concerns. Students will be taught how to analyze film as an artistic medium and, further, how film directors use the aesthetic elements of film to engage with important subjects. Through films by directors like Stanley Kubrick, Orson Welles, Wong Kar-Wai and Zhang Yimou, students get a chance to reflect on issues like the human condition, the family, the urban condition, love and society, and the nation."
  },
  {
    "value": "GEC1018",
    "label": "GEC1018 Names as Markers of Socio-Cultural Identity",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course focuses on names as a means of marking out the socio-cultural identity of the named and of the namer. Attention will be paid to anthroponyms (personal names), toponyms (place names) and commercial names. This course will be interdisciplinary in nature and will combine a range of approaches to names. Linguistic and philosophical approaches will provide the theoretical anchor to the topic of names. Subsequent seminars will contextualise names in their historical, geographical, political and literary contexts. There will be scope for students to develop the course in the direction of their interests in the mini project."
  },
  {
    "value": "GEC1019",
    "label": "GEC1019 Religion and Film",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "Cinematic and literary expression centred on religious topics can be studied to see how the vitality of cultural expression and power of the religious imagination interrelate. No prior training in artistic interpretation or religious history is required, though the course presumes a curiosity about religion and culture. It trains students to think about why people sometimes enjoy seeing films about painful topics. It clarifies the difference between “studying” and “practising” religion, and it teaches students to discuss controversial topics with tact."
  },
  {
    "value": "GEC1020",
    "label": "GEC1020 Cultural Diversity in The Contemporary World",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "How do we make sense of the world around us? How are our opportunities as individuals shaped by the ways our society is organized? By focusing on the lived experiences of people around the globe, this course explores big questions such as these. We will use the lens of cultural anthropology to investigate the diversity and complexity of human societies, and analyse how power is unevenly distributed based on social structures such as gender, race, and class. In doing so, the course will also reveal how many commonly held beliefs and behaviours are neither universal nor natural."
  },
  {
    "value": "GEC1021",
    "label": "GEC1021 The Theatre Experience",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "True",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "While many of us spend much of our lives glued to small computer screens, theatrical productions continue to bring people together for shared experiences. What are the attractions of theatre, what makes it distinct, and how can it enrich our understanding of human society? This course, which requires no prior knowledge of theatre, starts with the spectator’s experience and works outwards. We learn how to analyse theatre’s styles and effects. We explore how human societies use theatre to confront questions and express beliefs, hopes, and anxieties. We examine how cultures influence each other through theatre, and how theatre provokes change."
  },
  {
    "value": "GEC1023",
    "label": "GEC1023 Social History of The Piano",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "True",
    "desc": "An interdisciplinary study of how societies and different generations responded to the invention of the piano. This course focuses on the social history of the piano throughout the past three centuries, canvassing a wide array of performers, composers, supporters, manufacturers, “heroes”, politicians, teachers and students. Various expressions of ideologies from differing periods eventually revolutionised and effectuated the versatility of the piano, shaping a legacy which led to the “globalisation” of the piano, including China. Students will learn through lectures, readings, discussions, listening, playing, and attending piano recitals and masterclasses."
  },
  {
    "value": "GEC1024",
    "label": "GEC1024 Ghosts and Spirits in Society and Culture",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "True",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "Ghosts and spirits have been subjects of perennial interest in different human societies. At the same time, beliefs about persons with powers to initiate injury or good, and their relationship with spirits are found in almost all cultures throughout human history. This course introduces students to the scholarly study of ghosts and spirits, and the specialists and practitioners involved with these forces. These include shamanism, spirit possession, witchcraft and sorcery, and other supernatural entities such as zombies, vampires and werewolves, and how these intersect with issues of class, gender, sexuality, ethnicity, citizenship, popular culture, modernity and social change."
  },
  {
    "value": "GEC1025",
    "label": "GEC1025 The Life Aquatic: Machines and The Making of The Ocean",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "Oceans cover most of the globe. Yet once we venture from the shore, our understanding of the marine environment is necessarily mediated by technology, from the plumb line used by sailors for millennia to measure the water’s depth, to the latest satellite imaging tracking ocean currents in real time. This course examines how different “machines,” or technologies have produced understandings of the ocean across history, and places these technologies in their social, cultural, economic, and political contexts. The result is to reveal the complex and evolving interconnections that link technology, and society and our understanding of the natural world."
  },
  {
    "value": "GEC1026",
    "label": "GEC1026 Art in Asia: Through Media, Style, Space and Time",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course provides a thematic introduction to the major religious, traditional and decorative arts of Asia. Through a study of important architectural monuments, key works of art, materials and processes, students will explore the shared cultures, aesthetics and artistic achievements of India, China and Southeast Asia and how the visual arts of Asia were shaped by religious, imperial, political, economic, and social climates from its early civilizations to the modern era."
  },
  {
    "value": "GEC1027",
    "label": "GEC1027 Culture in Action",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "The course introduces students to the world of culture through specific examples. It examines the ways in which the cultural sphere produces value and significance for humans in society. It introduces students to different approaches to understanding culture, and explores the influence of the cultural sphere on both political and personal relations. Students will examine questions about communication, broadcasting, media technology, architecture, and cyberspace. The course also examines the ways in which culture is produced, disseminated, and consumed, i.e., through specific communities and contexts, and through types of popular culture, including film, television, popular fiction, performance, music, and digital culture."
  },
  {
    "value": "GEC1028",
    "label": "GEC1028 Luck",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course aims to highlight how luck has influenced and still influences several aspects of the world we live in. From the beginning of the universe, to our present-day lives, to the end of the universe, random events beyond anyone’s control continue to shape our fate. By exploring the various fields that luck manifests itself in, the course ultimately delves into the intriguingly precarious nature of existence."
  },
  {
    "value": "GEC1029",
    "label": "GEC1029 Worlds of Football",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "Football is found in one form or another in almost every part of the modern world. “Worlds of Football” takes the ubiquity and diversity of football as an entry point for critical examination of issues of geography and human culture at a range of scales – from the most intensely local and embodied, to globe-spanning networks. The course uses football as a window into: contextual and environmental variegation in human practices; worldly cultural politics (along lines of age, (dis)ability, class, gender, and race, among others); and processes through which everyday lifeworlds are bound up with distant and not-so-distant people and places."
  },
  {
    "value": "GEC1030",
    "label": "GEC1030 Metropolis: The City in World History",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "More people live in cities now than in any other point in history: how does this change human culture and civilisations? Cities tell a story of our world; they are a testament to humankind’s ability to reshape the environment in lasting ways. They reveal how we interact with the environment and with each other. Cities are created in many forms and for many reasons ranging from defense, religion and economic activity. Through case studies this course examines urban history, lived experiences and how city life has changed over time."
  },
  {
    "value": "GEC1031",
    "label": "GEC1031 Whatever It Takes? Making War on Civilians",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course seeks to analyse why killing ‘unarmed civilians’ has been so commonplace in war, across time and space. Why were defenceless unarmed people killed by armed forces? The word now used to define this theme is ‘non-combatant.’ But neither word nor concept is primordial, or was universal. The notion that some types of people should not be targets for military operations did not spring from our consciousness, or from any abstract sense of ethics or morality. It evolved historically, and not in any straight line. This course will ask the direct questions: how, why and to what ends?"
  },
  {
    "value": "GEC1032",
    "label": "GEC1032 Home",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "True",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "Few words in the English language (or any language) are as evocative and emotionally‐charged as “home.” But how do we determine what we call home, and why should we take “home” seriously? This course explores the political, social, economic, and cultural aspects of the complex idea of home. Major topics include: sense of place, home technologies and design, gender and housework, home and travel, globalisation, nationalism, homelessness, exile, and representations of home. Students will complete the course with a new appreciation for the complexity of the places – house, neighbourhood, nation, planet – they call home."
  },
  {
    "value": "GEC1033",
    "label": "GEC1033 Maverick or Mahatma? Gandhi's Life & Legacy",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course will examine the life and writings of Mohandas Karamchand Gandhi, regarded as one of the icons of the twentieth century and one of the principal architects of a free India. The course is meant to not only understand and analyse Gandhi’s thought but also to outline his extraordinary legacy. The course will introduce students to Gandhi’s writings and ideas on several issues, including non-violence, colonialism, modernity, ethics, science and health. The aim would be to not only expose students to the complexity of Gandhi — the man and his ideas — but to critically interrogate Gandhi and his legacies."
  },
  {
    "value": "GEC1034",
    "label": "GEC1034 Understanding the Changing Global Economic Landscape",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "Why and how have things changed and moved so fast? Why and how has the global economy become more open and integrated? This module discusses the increasing connections and mobilities of goods (like grains, oil, cars, appliances, parts & components), services (like banking, education, tourism), money and finance, labour, technology, ideas and information. It discusses their trends and patterns and critically examines the role of various factors such as international and regional institutions, media and ICT, infrastructure and distribution networks, state intervention, and private sector involvement. It also assesses the social, economic, political and environmental impacts of increasing interconnectedness and mobilities."
  },
  {
    "value": "GEC1034T",
    "label": "GEC1034T Understanding the Changing Global Economic Landscape",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "Why and how have things changed and moved so fast? Why and how has the global economy become more open and integrated? This module discusses the increasing connections and mobilities of goods (like grains, oil, cars, appliances, parts & components), services (like banking, education, tourism), money and finance, labour, technology, ideas and information. It discusses their trends and patterns and critically examines the role of various factors such as international and regional institutions, media and ICT, infrastructure and distribution networks, state intervention, and private sector involvement. It also assesses the social, economic, political and environmental impacts of increasing interconnectedness and mobilities."
  },
  {
    "value": "GEC1035",
    "label": "GEC1035 Patrons of The Arts",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course is a conceptual and practical introduction to the complex networks that drive \"patronage,\" including multifarious kinds of patronage. Issues raised and debated include exploring money, religion, politics, social classes, and many other social constructs that influence what art people support, and why they, especially you, support different kinds of art. Students will need to grasp and evaluate critically each set of issues that drive and affect patronage of the arts, and demonstrate their critical understanding of the interplay of these factors through written assessments, classroom discussions, and contributions to blog postings related to the course materials."
  },
  {
    "value": "GEC1036",
    "label": "GEC1036 Radiation-Scientific Understanding and Public Perception",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "True",
    "desc": "This course aims to equip students with the essential knowledge to make intelligent assessments on the potential risks and uses of radiation in our modern society. After introducing the physics behind various forms of radiation, we will look at how these radiations are used in medical diagnosis and treatment and other applications. Some controversial issues in these applications will be raised and debated. The health effects of high and low levels of radiation will be presented based on scientific evidence thus dispelling some of the negative misconceptions of radiation and irrational fear of it."
  },
  {
    "value": "GEC1037",
    "label": "GEC1037 Big Picture History",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course discusses ‘big picture’ History by considering defined themes that range across time and space. The focus is not on individual societies or time periods, but on questions related to commonalities in developments across all societies. This approach is like looking at a painting from a distance instead of at the brush strokes that constitute it, and will lead to questions about what human activities and experiences constitute the global experience. As part of the Thinking and Expression pillar, this course will help students think historically and also critically engage the maxim that ‘the past is a foreign country.’"
  },
  {
    "value": "GEC1038",
    "label": "GEC1038 Asian Cinema: The Silent Era",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course explores Asian cinema from its beginning to the introduction of talkies in the 1930s. The advent of cinema in Asia transformed entertainment across the continent and provided a novel means of popular expression. As a medium, cinema is closely tied to modernity and helps us understand how different societies and cultures in Asia responded to the modern transformation and how they appropriated it for their own ends. The course focuses on China, Japan, and India, three regions that developed a vibrant film culture and whose films have survived to the present day."
  },
  {
    "value": "GEC1039",
    "label": "GEC1039 International Relations of Asia",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "True",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "Asia has become part and parcel of world politics since the 19th century. This course examines how a wide range of ideas and ideologies borne in Europe have shaped the norms, practices and institutions of Asia’s politics and international relations. It explores the resilient nature of local norms and culture in the changing dynamics of international relations, particularly in the age of globalization. After this course, students will appreciate the historical background to contemporary developments and have acquired a solid basis of rationality in understanding international relations of Asia and in general."
  },
  {
    "value": "GEC1040",
    "label": "GEC1040 A Culture of Sustainability",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "True",
    "desc": "Cultures influence how sustainability issues are viewed and addressed in different contexts and situations. They determine the ways in which environmental, social, and economic considerations connect to sustainability and sustainable urban development. Success in our global sustainability efforts depends on our understanding of the underlying cultures and the connections between them, particularly in the face of urbanisation. This interdisciplinary course aims to raise our students’ awareness of these issues and to equip them with the critical thinking and collaborative decision-making skills necessary to find solutions to local and global problems of societal concern. Appropriate cross-cultural case studies will be discussed."
  },
  {
    "value": "GEC1040T",
    "label": "GEC1040T A Culture of Sustainability",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "Cultures influence how sustainability issues are viewed and addressed in different contexts and situations. They determine the ways in which environmental, social, and economic considerations connect to sustainability and sustainable urban development. Success in our global sustainability efforts depends on our understanding of the underlying cultures and the connections between them, particularly in the face of urbanisation. This module aims to raise our students’ awareness of these issues and to equip them with the critical thinking and collaborative decision-making skills necessary to find solutions to local and global problems of societal concern. Appropriate cross-cultural case studies will be discussed."
  },
  {
    "value": "GEC1041",
    "label": "GEC1041 Crime Fiction and Film across Space & Time",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "True",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course introduces the dazzling diversity of crime fiction and film, with a dedicated focus on the linkages among different geographical regions and cultural traditions. By examining common or similar plot elements and artistic techniques, the course conveys how authors and film-makers employ them in tales about crime to arouse audience interest. Students will get to sample Western detective fiction and Chinese court-case fiction, as well as be exposed to their adaptations in Japan and Latin America. The emphasis on grasping the tenets of adaptation will also be imparted through analyzing the relations between print media and moving images."
  },
  {
    "value": "GEC1042",
    "label": "GEC1042 Fashion: East and West",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course introduces a revisionist fashion history that decenters the West (Europe and North America) and places the East as its equal counterpart. Sartorial cultures in Asia are studied in their own right and on their own terms. Students will explore the history of global cultural exchange through the lens of fashion, understand the differences and similarities between Eastern and Western sartorial cultures, and gain critical insights into contemporary fashion consumption and industry. The course follows a chronological and thematic approach that examines fashion’s intersection with other domains of social life such as class, identity, and politics."
  },
  {
    "value": "GEC1043",
    "label": "GEC1043 Feasting and Fasting: Global Histories of Food",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course is intended to whet students’ appetites for a gustatory exploration of the past. We will consider various historical exchanges of ingredients across the globe, the refinement of techniques of culinary preparation, rituals of consumption, table manners and cutlery as well as the cultural significance of acts of feasting or fasting. Various religious, medical and cultural dietary regulations and taboos will be examined, along with the rise of sumptuary rules and connoisseurial practices, and the development of ‘dining out’. Finally we will analyse the role of food in the formation of various identities: nation, gender, class, diaspora."
  },
  {
    "value": "GEC1044",
    "label": "GEC1044 Chinese Medicine: Theory and Practice",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "The course offers the opportunity to explore traditional Chinese medicine through a survey of Chinese medical culture in its dynamic formation and transformation. The first half of the course gives students a historical overview of Chinese medicine— shaped by philosophy, natural science, religion, while influenced by political and social forces for 2,000 years. The second half allows students to study the theoretical foundation and practical aspects of Chinese medicine, which is opened to influence from western medicine and impact from modernity. Students will examine the globalisation of Chinese medicine, focusing on transregional connections and cultural negotiations with the world."
  },
  {
    "value": "GEC1045",
    "label": "GEC1045 Forbidden Romance in Modern Times: East and West",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course explores how “forbidden romance”—amorous engagement in fiction and reality—became the most volatile form of cultural expression in the modern world of revolution and enlightenment. Drawing on literary masterpieces across China and the West, it examines how the modern lure of free will and emancipated subjectivity drove Chinese intellectuals, Sinophone writers, and their Western contemporaries to redefine terms of affect, such as love, desire, passion, loyalty and sacrifice. It also looks into how the moral and political consequences of affect were evoked in such a way as to traverse or fortify consensual boundaries and their literary manifestations."
  },
  {
    "value": "GEC1046",
    "label": "GEC1046 Magic, Myths and Society in Southeast Asia",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "Magic and myths are omniscient components of Southeast Asian society. Accepted as an indubitable norm yet reviled as taboo, the duality of magic is a provocative yet little-explored aspect of local culture, faith and everyday realities. This course will examine the duality that magic envelopes; at once the secret hand behind myriad facets of life, from politics to love and living; yet simply accepted as an obvious given. Magic and mythmaking alleviate fear, help people cope with change and the unknown, and make the intangible, tangible. Magic’s role in righting injustices, recording denied history, and gender inequality are also explored."
  },
  {
    "value": "GEC1048",
    "label": "GEC1048 Death and Dying in the Human Experience",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "diverse beliefs, rituals and attitudes that have emerged across different civilizations and time periods in Southeast Asia"
  },
  {
    "value": "GEC1049",
    "label": "GEC1049 Powerful Court Women from Qing China and Other Cultures",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course explores the lives of empresses and concubines in Qing China, some of whom wielded tremendous power during their lifetime and have inspired numerous literary and media renditions of their words and deeds in the present. By critically assessing and deploying the concepts of gender, power, and media representation, the course highlights the curious connections between the Qing harem and other cultures, polities, and societies. More importantly, it establishes connections between Qing empresses and concubines and those elsewhere in the world, contextualizing their lives and activities in global history."
  },
  {
    "value": "GEC1050",
    "label": "GEC1050 Skyscapes: Cultural Interpretations of the Sky",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course traces how the sky has shaped cultures from across the world and in different times. We will explore how skywatching has provided answers to fundamental questions, such as the origins of life and the world, how society should be organised, and how our lives should be led. We will consider perspectives from Indigenous, European and Asian cosmologies, and discuss practices of prediction including astrology and meteorology. We will ponder the implications of technology that is now reshaping our sky. You will have the opportunity to reconnect with the sky and to discuss what the skies mean to you."
  },
  {
    "value": "GEC1051",
    "label": "GEC1051 Merchants, Guns and Money: The Economics of War",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course examines the relationship between economics and war. Armed conflict has always required the deep involvement of profit-seeking actors: mercenaries, merchants, trading companies, banks, corporations, and contractors. In turn, innovation and infrastructural development have instigated new methods of warfare. By examining the intersection of military and economic forces from around the world, from the early modern era to the present day, the course explores how the exigences of war have shaped the emergence of the nation-state, the development of capitalism, and the creation of global labor markets."
  },
  {
    "value": "GEC1052",
    "label": "GEC1052 From Traveller to Tourist",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course offers a broad survey of the evolution of travel and tourism, delving into its historical foundations and contemporary complexities. Students will examine the history of travel and exploration and its impact on cultural exchange, empire-building, economic development, and global connectivity. Students will trace the historical roots of the booming travel and tourism industry, and be introduced to contemporary issues related to travel consumerism, sustainability, and the influence of technology and social media. Students will develop an understanding of the multifaceted nature of travel and tourism within the broader historical and contemporary context of societal, cultural, and environmental dynamics."
  },
  {
    "value": "GEC1053",
    "label": "GEC1053 Rome and the Genealogy of Urban Life",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "When Rome grew into an empire, the city transformed itself into the capital of the known world. It was the first – and until London in the early 19th century – the only Western city to reach a population of a million. Rome reflected the grandeur and diversity of its empire. It was a cosmopolitan, multi-lingual, and multi-ethnic mega-city, which showcased Roman might, organizational efficiency, and cultural wealth through public works, monumental architecture, and a consumer culture. Studying Rome offers insights into the genealogy of Western urbanism and statecraft, because the city and its empire became paradigmatic in Western Eurasia."
  },
  {
    "value": "HSA1000",
    "label": "HSA1000 Asian Interconnections",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "True",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course adopts a multidisciplinary and comparative approach to the study of Asia and its regions. It will expose students to diverse perspectives and challenges that affect Singapore and other Asian societies such as ethnic and religious diversity, colonial histories, migration and social inequalities. The course equips students with conceptual and methodological tools to understand regional production in Asia, and emphasises experiential learning through field studies at various sites in Singapore. Students will leave the course with the critical skills necessary for a deep appreciation of the social, political and cultural diversity in Asia.This course adopts a multidisciplinary and comparative approach to the study of Asia and its regions. It will expose students to diverse perspectives and challenges that affect Singapore and other Asian societies such as ethnic and religious diversity, colonial histories, migration and social inequalities. The course equips students with conceptual and methodological tools to understand regional production in Asia, and emphasises experiential learning through field studies at various sites in Singapore. Students will leave the course with the critical skills necessary for a deep appreciation of the social, political and cultural diversity in Asia."
  },
  {
    "value": "NHS2098",
    "label": "NHS2098 Regeneration: Paradigm & Practice for Planetary Health",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "The health of the planet is an existential challenge requiring interdisciplinary approaches going beyond sustainability towards regeneration as paradigm and practice. This course introduces the ecological, social and cultural dimensions of regeneration in three steps. First, we strive to understand regeneration through systems thinking and complexity science, including the application of computational social science to ecological systems. Second, we seek to bring together stakeholders and student leaders to forge intercultural connections across generational divides. Third, we aim to develop interdisciplinary projects using regenerative approaches and the intercultural connections to tackle the ecological problems faced by vulnerable communities in diverse Asia."
  },
  {
    "value": "RVC1000",
    "label": "RVC1000 How in The World Do We Get Along?",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "Our world is figuratively shrinking. We increasingly encounter people who are different from us, such as in the areas of cultural backgrounds, language, religion, and values. We have to navigate these differences in our communities and workplace, and doing so requires us to effectively connect with people and work across cultures. With a focus on Emotional Intelligence (EI) and Cultural Intelligence (CI), this course empowers one to gain greater appreciation of cultural diversity and enhanced agility in collaborating and communicating in cross-cultural settings."
  },
  {
    "value": "RVC1001",
    "label": "RVC1001 The Rocky Road to SDGs",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "Diverse cultural values and norms can enable or hinder meeting the UN Sustainable Development Goals (SDGs). In this course, students will learn how culture impacts social sustainability and reassess their understanding of socio-cultural issues in regional and global contexts. Through team-led seminars, fieldtrips, roleplay, interviews, and critical discussions, students will learn to navigate cultural differences and develop solutions that address socio-cultural challenges in moving towards social sustainability. By exploring the complex relationships between individuals, society, governments, and supranational institutions, this course will develop students into sensitive global citizens with a holistic understanding of culture and the social pillar of sustainability."
  },
  {
    "value": "RVC2000",
    "label": "RVC2000 Culture and Sustainability in Southeast Asia",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "Southeast Asia is a region of diverse cultures with a myriad of sustainability challenges. It presents a rich context to explore concepts, practices, and issues in preserving the region’s cultural and natural heritage while pursuing economic and social development. In this course, students will critically examine the relevance of culture as the fourth pillar of sustainable development, alongside economic growth, social inclusion, and environmental conservation. By connecting classroom learning with field experience within Southeast Asia, students will develop an appreciation of different ways in which diverse communities interact with nature and recognise the need for the localisation of sustainable development."
  },
  {
    "value": "NHS2019",
    "label": "NHS2019 Virtue and Leadership",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course will examine the Biblical, Confucian, Socratic, and Modern or Machiavellian conceptions of the virtuous leader. The course is aimed at exposing students to the most representative texts of each tradition in order to gain depth of understanding of the competing conceptions of leadership, and their underlying assumptions about the nature of human beings. Students will also be expected to interrogate each tradition with a view to discovering its relevance to contemporary life."
  },
  {
    "value": "NHS2020",
    "label": "NHS2020 Leadership in a Complex World",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course adopts an eclectic, multi-disciplinary approach towards leadership. Through a section on Core Ideas and Great Texts, it highlights the key tensions and complexities involved in leaders’ decision-making, exemplified in seminal thinkers’ work on how to determine the “right” and / or “good”; and explores how these tensions/complexities play out in a selection of Great Texts, both literary and philosophical. A section on Contemporary Issues applies the ideas of leadership tension/complexity to current leadership challenges. A student-selected USPitch Project provides a first-hand practical experience of the issues explored in earlier sections."
  },
  {
    "value": "NHS2021",
    "label": "NHS2021 Language, Cognition, and Culture",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course explores the deep interconnections between language, cognition and culture. It begins with a consideration of the ‘discursive mind’ - that is, the particularly human way of knowing that uses language as its primary tool and medium. Realizing how much of human cognition is language-dependant, we then explore the relations between language, cognition and culture by looking at such everyday linguistic phenomena as code-switching, metaphor and gesture. Augmenting the reading of sociolinguistic and cognitive science texts in this course, students will also learn how to collect and to analyze empirical evidence of language phenomena in order to more critically assess the claims of such texts."
  },
  {
    "value": "NHS2023",
    "label": "NHS2023 Polycentric Governance: Possibilities and Pitfalls",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course takes an inter-disciplinary look at the multifarious concept of “governance” - how resources, issues and groups are organised and managed by a range of actors from the public, private and people sectors. Through a combination of academic work and case studies, the course explores (i) under what circumstances, and how, governance in the modern world needs to be more “polycentric” – taking place at multiple interlocking levels, including the global, national and local; (ii) key determinants of success or failure in different instances of polycentricity; (iii) both the benefits and limitations inherent in polycentric governance arrangements, as well as the challenges and obstacles to achieving greater polycentricity."
  },
  {
    "value": "NHS2031",
    "label": "NHS2031 Southeast Asia: The Making of a Region",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "In the aftermath of colonialism, a host of decolonizing experiences produced different successor regimes - from democratic to semi-authoritarian to communist. This course focuses on the geographical basis, historical background, and contemporary birthing of regionalism, amidst such diversity. It aims to introduce students to the political, strategic and economic aspects of regional cooperation, particularly through ASEAN. It also encourages them to consider the cumulative impact of such cooperation on the formation of a Southeast Asian regional identity, and the prospect of an indigenous collective political imagination bridging the diverse communities."
  },
  {
    "value": "NHS2036",
    "label": "NHS2036 Questioning Sustainable Development",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course examines the tension between ‘need’ to ‘develop’ and imperatives of conserving natural resources in the backdrop of enormous socio-economic and environmental challenges we face today. Sustainable development (SD) emerged as a response to confront these challenges; whether it has served its purpose or not remains debatable. Different scientific, technological, economic and political instruments encompassing sustainable development (SD) will be critically evaluated. The criticality of natural resources and their consumption patterns will be presented to the students. The need to engage local communities in new ways in social construction of SD would be discussed."
  },
  {
    "value": "NHS2039",
    "label": "NHS2039 Understanding Law and Social Change",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "How does law affect people and society? How do people and society influence law? Can law bring about social change? In what ways? This course approaches the study of law as a social institution, and examines law, legal actors, and legal institutions from various perspectives such as sociology, psychology, political science, and legal scholarship. We will discuss theoretical perspectives on the relationship between law and society, the relationship between law and social behaviour, law in action in various social contexts, the role of law in social change, and the roles of lawyers, judges, and juries."
  },
  {
    "value": "NHS2041",
    "label": "NHS2041 Participatory Social Development in Southeast Asia",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "Southeast Asia is widely regarded as a model for economic development due to its advances in alleviating poverty, improving infrastructure, and fostering education and healthcare. But economic success often overshadows critical social problems that arise in tandem with such rapid development. This course, offered only in special summer sessions, takes a hands-on approach to examining critical issues in social development, in particular those revolving around local empowerment, democratization, and sustainability. Working within a framework of participatory action research, and collaborating with peers at another ASEAN university, this rigorous course includes substantial fieldwork conducted among development projects outside of Singapore."
  },
  {
    "value": "NHS2045",
    "label": "NHS2045 Social Movements, Law, and Society",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course provides theoretical understanding and empirical knowledge about social movements and their relationship with law and society. How does collective mobilization emerge? We begin with this question and then turn to the different approaches of analyzing social movements. We will also consider how states and other movement opponents suppress and control social movements, and how movements respond to repression, and deploy, even spread, their ideas, strategies, and tactics within and across movements, as well as across national borders. In examining these issues, we will use case studies, and discuss the role of law, including how it matters to the social control of social movements, movement strategies, tactics, and decision-making, and movement effects."
  },
  {
    "value": "NHS2048",
    "label": "NHS2048 Situating Singapore in the Wider World",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "This course charts the roles of Lee Kuan Yew, S Rajaratnam and Goh Keng Swee in shaping the foreign policy of Singapore from 1965. Key Singapore policymakers and diplomats such as Tommy Koh, Kishore Mahbubani & Bilahari Kausikan acknowledge that in particular the longevity of Lee’s tenure and his strategic philosophy structures Singapore’s actions internationally. This course examines the impact of the leadership’s ideological assumptions on how Singapore navigates its relations with 3 major areas, ASEAN, the US and the regional powers, China and India and adapts to the current inflection point in the international diplomacy of Indo-Pacific region."
  },
  {
    "value": "NHS2049",
    "label": "NHS2049 Culture and Technology",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "It is commonly known that technology and culture are intricately interconnected to each other, existing in a relationship that is mutually constitutive. Technology produces culture as much as the other way around. But such a relationship is complex and controversial. Both technology and cultural producers are not often selfreflexive about how the relationship impacts on their work, and unaware of the resulting ethical dilemmas and politics. This course introduces students to critical concepts in culture and technology studies focusing on social and political change, transformations in the way we think about civilization, and the formation of identity."
  },
  {
    "value": "NHS2050",
    "label": "NHS2050 Gender and Ecology in Asia",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "Women around the world struggle with the various fallouts from climate crisis. This vulnerable demographic struggles to combat both real and ideological conditions connecting women and Nature. Cognizing this, the field of Ecological feminism [Ecofeminism] has grown rapidly in the past few decades. This introductory course to ecofeminism will combine literary analysis, environmental humanities and feminism. It will extend students’ knowledge of feminism and environmental issues relating to women. Fundamental to the study will be the literary analysis of texts taught in a scaffolded way. The course will examine literary texts by Asian women across South, East and Southeast Asia."
  },
  {
    "value": "NHS2051",
    "label": "NHS2051 Democracy and Inequality",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "Does social inequality matter? This course aims to examine different theories of the link between social equality and democracy, and related concerns pertaining to the value of social equality and the significance of equality of opportunity in a democratic society. These discussions will form the theoretical background for this course. In the second half of the course, students will apply this theoretical framework to contemporary issues related to democracy, in the global and Singaporean context, as well as evaluate policy proposals aimed at mitigating social inequality, specifically Universal Basic Income."
  },
  {
    "value": "NHS3001",
    "label": "NHS3001 The Problematic Concept of \"Gender\"",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEC",
    "hasMCQ": "False",
    "desc": "What is \"gender\"? What kinds of definitions have been advanced or implied for this perplexing word? How have thinkers - in fields as diverse as anthropology, history, literature, philosophy, psychology, science studies, and sociology - helped to define and even invent this category that we call \"gender\"? How have these definitions changed the way we think? What kinds of problems have these definitions created? In this module, we will analyse various moments in intellectual history when there has been a struggle over the meaning of \"gender\" (and seemingly related terms like \"sex\" and \"sexuality\") in order to understand the term's function as a category of analysis."
  }
]