[
  {
    "value": "GEX1000",
    "label": "GEX1000 Framing Bollywood: Unpacking the Magic",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "Bollywood cinema is an iconic aspect of Indian popular culture and a striking manifestation of India’s global ‘soft power.’ This course aims to interrogate core concepts in the humanities and social sciences through the lens of India’s most powerful film industry. Through an exploration of selected films, students will think critically and creatively about key cultural, social and political themes originating in the subcontinent. They will analyze important developments in India and the diaspora through the study of Bollywood cinema. The course will thus facilitate a nuanced understanding of the relationship between text and context, with a focus on Bollywood."
  },
  {
    "value": "GEX1001",
    "label": "GEX1001 Representation and Media",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "Can popular culture influence our perceptions? How do we decode the secrets of storytelling to examine the production, distribution and consumption of media content? In this course we uncover the interplay between media and representation through the introduction of basic concepts in the representation of gender, race, politics, celebrities, communities, and otherness in popular culture. We’ll be examining the themes of production, the distribution of content, and how audiences engage with popular culture in this digital age."
  },
  {
    "value": "GEX1002",
    "label": "GEX1002 Life, Disrupted: The Sharing Revolution",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "The Sharing Economy (a.k.a. Collaborative Consumption or Peer Economy), describes the development of new business models or platforms, through the coordinated exchanges between individuals, that disrupt traditional markets by redefining industry categories, lowering transaction costs, and maximizing the use of scarce resources. We will explore how sharing economy platforms transform the way we live: how we consume, how we work, and how we trust. Finally, we evaluate the policy responses of governments, to mitigate potential threats to our social compact as a result."
  },
  {
    "value": "GEX1003",
    "label": "GEX1003 Seeing the World Through Maps",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "In general, this course is aimed at getting student to critically engage with the ‘work’ or ‘power’ of maps in shaping the historical emergence of the modern world and in its ongoing transformation. To do this we will combine diverse modes of learning, covering issues of knowledge and content (the history of cartography), practical skills of map making/reading, and critical skills of evaluating and interpreting maps. We will stimulate a critical awareness of mapping as an evolving technology that has far-reaching social and political considerations."
  },
  {
    "value": "GEX1004",
    "label": "GEX1004 Bridging East and West: Exploring Chinese Communication",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This course offers NUS students an opportunity to explore different aspects and contexts of Chinese communication. The target audience is English speaking undergraduates with minimal Chinese language proficiency. The various contexts of Chinese communication include advertising, business, the press, social communication, regional usages, pop culture, translations, meaning of Chinese names, codeswitching and the use of Chinese dialects. It is intended to serve as a primer for students interested in these areas of study. A minimum Chinese language proficiency of CLB is required."
  },
  {
    "value": "GEX1005",
    "label": "GEX1005 Public Speaking and Critical Reasoning",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This course prepares students to be effective public speakers and critically attuned listeners. It introduces students to theories of oral communication and public speaking, as well as practical strategies for analysing and connecting with audiences, gathering and structuring relevant information, employing effective rhetorical devices, incorporating visual aids, and delivering purposefully engaging speeches. Importantly, students will be given multiple opportunities to practise their speaking skills and to give and receive critical constructive feedback. Through experiential and reflective learning, students will gain confidence in speaking in academic, professional and public settings."
  },
  {
    "value": "GEX1005T",
    "label": "GEX1005T Public Speaking and Critical Reasoning",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This module prepares students to be effective public speakers and critically attuned listeners. It introduces students to theories of oral communication and public speaking, as well as practical strategies for analysing and connecting with audiences, gathering and structuring relevant information, employing effective rhetorical devices, incorporating visual aids, and delivering purposefully engaging speeches. Importantly, students will be given multiple opportunities to practise their speaking skills and to give and receive critical constructive feedback. Through experiential and reflective learning, students will gain confidence in speaking in academic, professional and public settings."
  },
  {
    "value": "GEX1006",
    "label": "GEX1006 The Art of Science, The Science of Art",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "It often seems the worlds of science and art are unrelated: Logical truth versus emotional imagination. Still, science and art have much in common. Science has caused paradigm shifts in artistic expression while art is used for engineering design and communication of scientific knowledge. In this module, students will be introduced to the use of materials and technology related to architecture, sculpture, painting, photography and imaging. The use of technology for dating and attribution of objects of art as well as the use of visual art for scientific illustration and design will be examined. Knowledge of the scientific principles of various forms of visual art will also be explored. The module aims at the development of some artistic skills for illustrations of scientific concepts and engineering designs. This module will help students to better express their thoughts through artistic expression and appreciate visual art."
  },
  {
    "value": "GEX1007",
    "label": "GEX1007 Darwin And Evolution",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "True",
    "desc": "Charles Darwin is the most influential figure in history of science. However, public understanding of Darwin and evolution remains a serious problem. What most people think they know about Darwin and his theory of evolution is wrong. This course provides a solid background for understanding how the ‘Darwinian revolution’ actually unfolded. It covers the history of geology, palaeontology and biology from the 1700s to the 20th century. The central focus is on the life and work of Darwin and how biological evolution was uncovered, elaborated, debated, and accepted by the international scientific community in the 19th century, and beyond."
  },
  {
    "value": "GEX1009",
    "label": "GEX1009 Understanding Your Brain",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This module will explore how our brain can affect our behavior. It will introduce how classical and modern neuroscience research tools are used to investigate the workings of the brain. We will also examine the ethical and social issues raised by recent developments in neuroscience research. In addition, this module is expected to enable students to develop critical skills in analyzing and writing about controversial issues concerning neuroscience and society."
  },
  {
    "value": "GEX1010",
    "label": "GEX1010 Thinking Like An Economist",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This course aims to explain human behaviour through the lens of economists. We use economic reasoning to answer questions as diverse as the following: Why would your teacher cheat? Which factors cause crime rates to go down? Why do countries fail sometimes? We use texts that popularize economic concepts to illustrate how different social phenomena can be understood by applying the tools of economic analysis. However, we also discuss possible limitations of the economic approach to social issues. In this course we review, challenge, and debate on firmly established ideas we all have about the world, our society, and ourselves."
  },
  {
    "value": "GEX1011",
    "label": "GEX1011 Science Fiction and Philosophy",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This course considers science fiction as a mode of philosophical inquiry. Science fiction stories are used to examine fundamental questions of metaphysics, epistemology and ethics. Topics include the nature of time, space, religion, nature, mind, and the future. Specific topics may include such issues as genetic enhancement, environmental ethics, and implications of encounters with non‐human life forms."
  },
  {
    "value": "GEX1012",
    "label": "GEX1012 Effective Reasoning",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "True",
    "desc": "What is good reasoning? We will try to answer this question by studying the mechanics of reasoning. Students will learn what an argument is, what the difference between validity and soundness is, and what it means to say that an argument is valid in virtue of its form. They will also be introduced to various strategies and pitfalls in reasoning. In addition, to hone their analytical skills, students will be given arguments—drawn from philosophy and other areas—to unpack and evaluate. It is hoped that in the process of learning what counts as good reasoning, one will become a better reasoner."
  },
  {
    "value": "GEX1013",
    "label": "GEX1013 Reason and Persuasion",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "For the first six weeks, students read three dialogues by the ancient Greek philosopher, Plato: Euthyphro, Meno, and Republic, Book I. These readings touch on a wide range of topics: mind and morals; politics and psychology; metaphysics and science. For the second six weeks, students will meet with the same problems, ideas and arguments, but as they manifest in the writings of various contemporary figures – philosophers and non-philosophers: psychologists, political scientists, public policy experts. ‘Reason and Persuasion’ is a generic title. But it indicates a specific concern. Reason without persuasion is useless; persuasion without reason is dangerous. Plato worried about this; so will we."
  },
  {
    "value": "GEX1014",
    "label": "GEX1014 Logic",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "Logic, as a branch of philosophy, is the study of valid argument. Each logical system puts forward its own definition of validity, which purports to approximate our informal notion. This course provides an introduction to classical logic. The first half of the course focuses on propositional logic, and the second half on first-order predicate logic, a natural development of the former."
  },
  {
    "value": "GEX1015",
    "label": "GEX1015 Life, The Universe, And Everything",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "True",
    "desc": "This course offers an opportunity to grapple with some of the most enduring challenges to human thought. Our starting point is a conception of ourselves as free and conscious beings equipped with bodies that allow us to observe and explore a familiar external world. Successive lectures investigate alternative conceptions of the human condition, such as ones in which we are unfree, or non-spirituous, or inhabit a world whose fundamental nature is hidden from our view. Different conceptions bear differently on the further question of what we should value and why. Discussion is both argument-driven and historically informed."
  },
  {
    "value": "GEX1016",
    "label": "GEX1016 Building Relationship : Theories and Practice",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This course critically examines theoretical issues and applications of effective interpersonal communication in enhancing interpersonal relationship building. The content will include various theoretical frameworks, models and issues related to interpersonal communication. It will also introduce course participants to interpersonal practice in dealing with diverse individuals. Experiential learning methods will be used in tutorial groups to develop critical thinking abilities on relationship building issues, and to translate the thinking abilities into interpersonal practice using case study, role play and reflection."
  },
  {
    "value": "GEX1017",
    "label": "GEX1017 Communication and Critical Thinking for Community Leadership",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This critical thinking and communication course provides an opportunity for students to explore community leadership within an interdisciplinary environment. In particular, through understanding the constructivist theory of communication (Burleson, 2007) and Paul and Elder’s (2014) critical thinking framework, this course will facilitate the development of deliberative and active citizenry among students, regardless of the position they hold in the community. Students will apply these concepts individually to short case studies and reflections. They will then use these short assignments to conceptualize team projects relevant to their respective community settings."
  },
  {
    "value": "GEX1018",
    "label": "GEX1018 Critical Perspectives in Advertising",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This course critiques the effects of advertising. Specifically, it deconstructs the role of advertising as practiced by commercial, non-commercial and a variety of other entities to persuade us to adopt products, services, ideas, and ideologies. In doing so, we highlight negative and positive advertising effects from communicative, psychological, cultural, sociological, and political perspectives. Various social and ethical implications of advertising on society in general, and on various vulnerable populations, such as children, minorities, and women, in particular are also discussed. The course promotes approaches to manage advertising influences through active citizen participation to achieve a more enlightened society."
  },
  {
    "value": "GEX1019",
    "label": "GEX1019 The Logic of Language",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "Our capacity for language is a defining aspect of what it means to be human and is central to both thought and communication. This course investigates the rules that underlie what we say, how meaning is encoded, and how we reason with language. We will apply mathematical tools of pattern description and logic to describe and better understand human language, with the goal of developing logical explanations for linguistic phenomena. Comparison to artificial and programming languages will be discussed. Emphasis will be placed on clear, precise descriptions and their accessible communication through writing and oral presentation."
  },
  {
    "value": "GEX1020",
    "label": "GEX1020 Communication in Small Groups",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This course is designed to help students understand the theoretical and practical aspects of small group communication so that they may function more effectively in groups. Particularly, the course will facilitate discussion on effective communication in the group communication process. Effective communication in a community, public, or professional setting requires an understanding of how people behave in a group context and how they interact with others inside and outside the group."
  },
  {
    "value": "GEX1021",
    "label": "GEX1021 What, When and Where Is Art?",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This course explores the arts through three different, but overlapping, questions: What is art? (including the polemics associated with this question), When is art? (i.e. creations that are interpreted as art, or not art, at different times), and Where is art? (i.e. why something is perceived as art when it is in one setting, but is generally otherwise unnoticed). Visits to Singapore locations for case studies are required. Students will study and apply several disparate theories, and will also write their own."
  },
  {
    "value": "GEX1022",
    "label": "GEX1022 Communicating About the Arts",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "We talk and write about the arts on a daily basis, especially in social media, but what makes talking and writing about the arts unique, challenging, and why should it be exciting? This course helps students further develop the basic concepts and expressive language needed to communicate more effectively about different art mediums and forms, and different ways to communicate about the arts, from opinions and evaluations, to formal reviews, to critical and theoretical responses. Students will do multiple oral and written assessments in this course."
  },
  {
    "value": "GEX1023",
    "label": "GEX1023 Disney And the Theme Park World",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "True",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This general education course will explore the world of theme parks, originally inspired by the films and vision of Walt Disney. The course will examine a history of this leisure form, and examine how theme parks and theming offer us an interesting lens to understand the contemporary world. What are the values and ideologies that are inscribed within theme parks? Is there a specific “culture” associated with Disney? By examining the Disney phenomenon and the world of theme parks, students will be challenged to think critically about aspects of leisure and popular culture that shape our world views."
  },
  {
    "value": "GEX1024",
    "label": "GEX1024 Universe, Big Bang, And Unsolved Mysteries",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "In this module, students will explore the universe, its contents, properties, evolution, and origin. Major topics to be covered include ideas and concepts of the universe, astronomical observations, scientific models, big bang theory, and unsolved problems in cosmology."
  },
  {
    "value": "GEX1025",
    "label": "GEX1025 Structures of Conversation",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "What are the elements that go into organising a conversation? This course examines the intricacy and complexity of conversational structure such as the emergent structure of the talk, its prosodic features, gesture, eye-gaze coordination, etc. in everyday life. Students learn the tools and methods of Conversation Analysis (CA) to analyze micro-level human interactions and everyday talk-in-interactions. Placing conversation as the primordial site of human society, CA uses naturalistic conversational data as empirical evidence to discover how people negotiate, construct and perpetuate societal norms through everyday conversation, and how even routine interaction is meaningful and achieved collaboratively with others."
  },
  {
    "value": "GEX1026",
    "label": "GEX1026 I Do Not Think Therefore I Am",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This course aims to call attention to the fundamental importance of thinking not only in learning per se but also in shaping who we are. It examines the nature of thinking, as well as its mechanisms. It aims to help students experience the excitement of thinking as they try to understand what thinking is; students are thus compelled to critique and re-examine their own assumptions about what they think they know and about themselves as psychosomatic learners and persons."
  },
  {
    "value": "GEX1027",
    "label": "GEX1027 Art and Identity",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "From what sources do we engender our individual and group identities, and to what extent do the arts stimulate this process? This course begins with an introduction to identity theory, and then explores identity issues – such as male and female, self, national, racial, and social identities – with an emphasise on their manifestations in various performance, visual, and literary art forms. Students will analyse and evaluate their own identities in relation to the course materials and the arts in their lives, requiring critical self-reflection and self-assessment."
  },
  {
    "value": "GEX1029",
    "label": "GEX1029 Narrative",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "In this course, students will learn the basic concepts of narrative. It will expose them to narrative as a basic idea that runs through their lives, and which has its most sophisticated manifestations in literature and cinema. While the analysis of literary and cinematic texts will play an important part in the course, students should also develop an awareness of how narrative is used in everyday discourse, and how it shapes their response to reality."
  },
  {
    "value": "GEX1030",
    "label": "GEX1030 Standard English Across Cultures",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "With special reference to Singapore, this course examines English – especially its standard form - as the leading global linguistic and cultural resource for intra- and inter-cultural communication. Students use a variety of tools to analyse language in terms of phonetics, lexis, grammar, and meaning in context. We ask questions such as the following: (1) Why does the idea of ‘standard language’ appeal to human cultures?; (2) What does ‘standard English’ comprise?; (3) What happens to the shape of English when local culture is blended in? (4) Are ‘native speakers’ really native?; (5) Does 'Standard Singapore English' exist?"
  },
  {
    "value": "GEX1031",
    "label": "GEX1031 Hollywood Cinema: Constructing the Realistic",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "Hollywood cinema is arguably the most popular and dominant cinema in the world but it is also a group style that represents a particular mode of expression and approach to the cinematic medium. This course explores the ways that Hollywood has used film form to create a naturalised style and viewing experience. We will study its conventions as well as the variations and deviations that push the envelope or constitute alternative constructions of the realistic. This course is 100% CA and some of the films studied may have mature content."
  },
  {
    "value": "GEX1032",
    "label": "GEX1032 “Fake News” In the Public Sphere",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "“Fake news” is one of the biggest issues that societies have to contend with in recent years. Regardless of the discipline or field of specialisation, organisations now need individuals who are able to discern facts from opinions, critically evaluate information, and understand different policies associated with fake news. This course introduces frameworks and concepts for critically thinking about and analysing “fake news” and equips students as digital citizens with critical information literacy skills. Topics to be covered include: critical literacy, political economy of fake news, international policy responses, fact-checking strategies and techniques, and responsible reporting, writing and sharing."
  },
  {
    "value": "ES2631",
    "label": "ES2631 Critique and Communication of Thinking and Design",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This course equips students with competencies that enable students to analyze, critique, and communicate engineering and design ideas in a systematic and thoughtful manner. Students will be introduced to the Engineering Reasoning Framework (Paul, Niewoehner and Elder, 2019), as well as key principles of effective academic communication. Students will learn to apply the critical thinking framework and communication principles to critique ideas expressed in different genres and to convey these in critique essays. They will also engage in a group project aimed at promoting critical analysis and communication in teams that will culminate in a team academic oral presentation."
  },
  {
    "value": "ES2660",
    "label": "ES2660 Communicating in the Information Age",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "True",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "In a context of prolific production and convenient access to content and innovation in the Information Age, how should one critically process and clearly communicate ideas to various audiences? Using established critical thinking and digital literacy frameworks, this course aims to help learners hone their abilities to (1) critically question, analyse, and evaluate issues related to their own discipline and profession from multiple perspectives; and (2) articulate critical analysis and evaluation in multimodal forms of communication."
  },
  {
    "value": "HSH1000",
    "label": "HSH1000 The Human Condition",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "True",
    "GEPillar": "GEX",
    "hasMCQ": "True",
    "desc": "What does it mean to be human? What triumphs and struggles, hopes and responsibilities go along with calling ourselves “human”? The course introduces students to creative and analytical works from various times and places that explore morality, society, and identity from different perspectives. In reading and discussing them, students hone humanistic critical thinking skills that they can apply in the classroom and beyond. They will experience how words shape worlds, and discover how enduring concerns of being human have defined us, just as we continue to redefine them through our actions and expressions.What does it mean to be human? What triumphs and struggles, hopes and responsibilities go along with calling ourselves “human”? The course introduces students to creative and analytical works from various times and places that explore morality, society, and identity from different perspectives. In reading and discussing them, students hone humanistic critical thinking skills that they can apply in the classroom and beyond. They will experience how words shape worlds, and discover how enduring concerns of being human have defined us, just as we continue to redefine them through our actions and expressions."
  },
  {
    "value": "MUH1101",
    "label": "MUH1101 Critical Approaches to Musical Discovery",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "Our understanding and experience of music are intrinsically linked to the cultural, historical, socio-economic and critical contexts in which music-making occurs. In this course, students will examine music as a cultural and social phenomenon, analysing and evaluating values and ideologies that have shaped historical and contemporary musical practice. Students will acquire shared vocabulary and frameworks to research and communicate effectively about music, and gain an understanding of essential musical concepts and genres. Students will develop confidence in expressing their own artistic perspectives and reflect on their individual roles in an evolving musical ecosystem."
  },
  {
    "value": "RVX1000",
    "label": "RVX1000 Citizen Speak: Persuasion and Polarization in Society",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "How do people engage with issues that matter to society? In this course, students will critically examine how citizens and their leaders use communicative resources to deal with issues pertaining to sustainability, processes of inclusion and exclusion, and public participation in various contexts, among others. What rhetorical strategies do they mobilize to encourage dialogue needed to create agreeable solutions to the burning issues of the day? What strategies hamper such a dialogue to take place? By pursuing these questions, the students will develop a critical disposition towards the role of civic discourse in shaping public issues."
  },
  {
    "value": "RVX1001",
    "label": "RVX1001 Science Fiction and Society",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "Science Fiction serves as a launch pad that inspires innovative ideas and a space to critically evaluate contemporary issues such as race, gender, technology, and climate change. This course engages students’ thinking on one of the most important and influential popular media to develop broader insights and perspectives on current social trends that will help them both within and after university. Students will construct a thoughtful critique of science fiction topics found in media like film, television, short stories, or video games. Working collaboratively, they will present questions and reflections to peers to increase their critical expression skills."
  },
  {
    "value": "RVX1002",
    "label": "RVX1002 What Do You Mean? Meaning and Communication in Intercultural Contexts",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This course examines meaning and culture. It draws attention to issues in translation and intercultural communication, and advocates the use of a framework that facilitates effective communication with cultural others at work or elsewhere. As cultural beings, we express meaning in a cultural context, but do we understand the implications? We assume that English words have the same meaning across cultures, but how valid is this assumption? We learn Standard English but does it embody the cultural meanings we want to express? This course raises awareness of our cultural selves and helps students develop meaningful connections with cultural others."
  },
  {
    "value": "RVX1003",
    "label": "RVX1003 Print to Screen: Analysing Film Adaptation",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "In this course, students will examine how various literary texts are adapted into films. They will do so by interrogating how directorial techniques, institutional constraints and related socio-cultural contexts inform adaptations. Specifically, students will watch and analyse cinematic adaptations of plays, short stories, and comics to bring to the surface how aesthetic elements ranging from mise-en-scene to socio-cultural factors influence filmmakers and studios’ motivations. In the process, students will develop a systematic approach in carrying out a critique of adapted films they enjoy."
  },
  {
    "value": "RVX1004",
    "label": "RVX1004 Cultural Expressions of Science, Technology and Warfare",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "Since the 20th century we have witnessed the increased intimacy between science and violence. Eugenics and nuclear warfare, for example, demonstrate the violence of rationalized progress when in the service of war. The increasing threat of rationalized violence today undermines sustainable development by hindering practices necessary for human vitality. In this course, students examine cultural expressions of modern warfare, critically reflecting on what they suggest about the relationship between science, technology and war. Students are thereby encouraged to reflect on the circumstances of armed violence and the need to prevent it."
  },
  {
    "value": "RVX1005",
    "label": "RVX1005 Intersectionality, Identity and Inequality in Asia",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "Inequality is a persistent yet complex structural issue in modern societies. As a critical theory, intersectionality explains how inequality is informed by the interaction of multiple identities, including gender, class, race, sexuality, and nationality. By drawing on intersectionality theory, this course examines patterns, implications, and solutions for social inequality in the Asian context. What is intersectionality? What does intersectionality imply in making a fair, sustainable society? With an understanding of intersectionality, students will examine how inequality issues are critiqued in scholarly articles and develop writing skills that express their own perspectives on inequality and identity."
  },
  {
    "value": "NTW2001",
    "label": "NTW2001 Cosmopolitanism and Global Citizenship",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "“What is the meaning of the term “global citizenship”? What is its significance? And what are the obstacles and challenges to it? This course teaches academic writing through a critical exploration of the concept of global citizenship. Topics discussed include the historical doctrine of cosmopolitanism, the relevance of global citizenship as a moral, economic and cultural ideal as well as the institutionalization of global citizenship in the education curriculum. The course encourages students to reflect on the notion of global citizenship in the contemporary world, as well as their responsibilities as cosmopolitan citizens.”"
  },
  {
    "value": "NTW2004",
    "label": "NTW2004 Narrative in Everyday Life",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "Everyday narratives are those informal stories we tell each other about ourselves and our quotidian experiences. In this course, such narratives will be analyzed in terms of identity politics, how they instantiate social power, and how they frame epistemological knowledge, such as scientific discourse, not normally associated with narrative as a mode of representation. Students will generate a corpus of genuine sociolinguistic narrative data and analyze it in an interdisciplinary framework."
  },
  {
    "value": "NTW2006",
    "label": "NTW2006 Human Trafficking and Labour Migration",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This course teaches writing and critical thinking through forms of human trafficking in the contemporary world. Topics discussed include sex workers, migrant labour, abolitionist and human rights approaches to human trafficking, as well as media representations. The course thus provides the opportunity for students to reflect on the nature of problem in the contemporary world, as well as their responsibilities as global citizens."
  },
  {
    "value": "NTW2007",
    "label": "NTW2007 Apocalyptic Cultures",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This course primarily introduces fundamental skills of writing that are appropriate to the interdisciplinary context of the USP. It does so by advancing various topical questions surrounding our fascination with and anxieties about the portentous and cataclysmic events leading to the end of world. Are these concerns new or culturally specific? Are these apocalyptic visions obsessed with finality or are they genuinely more interested in new beginnings? In exploring these topics, students develop skills necessary in reading primary and secondary texts, to ask focused questions and explain why they matter, and ultimately to respond with well-formed arguments."
  },
  {
    "value": "NTW2008",
    "label": "NTW2008 Power, Space and Pleasure",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This course examines the ways power, space, and pleasure are interconnected. The course is divided into three units. First, we will look at how space is related to questions of power, focusing in particular on surveillance. Then, in the second unit, we will consider more closely the relation between space, power and pleasure as exemplified in voyeurism and surveillance : here we will be watching people watching other people. Finally, we'll consider the relations between space, power and pleasure in Singapore, in particular as this applies to the tensions between traditional practices and urban planning in city spaces here."
  },
  {
    "value": "NTW2010",
    "label": "NTW2010 Sites of Tourism",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This course like others in the Writing and Critical Thinking area helps students become better writers of argumentative essays. To do this, we will specifically examine the modern phenomenon that is tourism, asking questions such as: What is a tourist? Why do we become tourists? Why do we send postcards, take photographs, or collect souvenirs? Do tourists find ourselves when we go abroad? Do we lose ourselves? How are cultures packaged for tourists, and is this packaging always reductive? Such questions will help us to understand the assumptions behind tourism, and to explore issues of modernity, nationality, self and other, identity and culture."
  },
  {
    "value": "NTW2012",
    "label": "NTW2012 Conditions of Happiness",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "In this course, we will investigate a fundamental human question: what is happiness, and what do we need to attain it? Is happiness in our own control or does it depend on external circumstances, such as wealth or freedom? Are pleasure or virtue necessary or even sufficient conditions of happiness? What constitutes a meaningful life, and how is meaning related to happiness? To reflect on such questions, we will investigate the arguments of philosophers, psychologists, economists, and other thinkers over the course of three thematic units."
  },
  {
    "value": "NTW2014",
    "label": "NTW2014 Clothing Identities",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "The subject students will think, read, and write about in this course is clothing and identities. Do clothes make the man or woman? Most people accept that the clothes we wear say something about us? Particularly about our race, gender, class, and power status. But what do they say, exactly? How do they say this? Why have we learned to see clothes as speaking thus? Furthermore, if clothes say certain accepted things, what happens when people dress in inappropriate ways?"
  },
  {
    "value": "NTW2016",
    "label": "NTW2016 Civility in the World City",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "A topic of profound interest to philosophers, social scientists and moralists, civility sets the conditions in which differences of opinion are admitted and aired. All too often, civility is taken for granted : just good manners. But actually, civility is one of the most intricate social frameworks, perhaps especially in a world city such as Singapore. This course surveys recent ruminations about civility in personal, professional and civic life to foster discussion of real-world interactions."
  },
  {
    "value": "NTW2017",
    "label": "NTW2017 Multidisciplinary Perspectives on “Mind”",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "What is \"the mind\" and where does it fit in the interdependent histories of nature and culture on our planet? Does \"mind\" reduce to brain activity? Or is it more than just the electro-chemical exchange between neurons? As minded creatures with brains ourselves, the ways in which we delimit the mind/brain relation has enormous consequences for the ongoing instruction of our legal, social, medical and ethical lives. In this course, we will study some of the major approaches to this issue, and attempt to discover what it is that we are really talking about when we are talking about \"mind.\""
  },
  {
    "value": "NTW2018",
    "label": "NTW2018 Danger and National Security",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This course introduces students to skills necessary for writing an academic essay. It does so by facilitating students' ability to think critically about the relationship between the concepts of \"danger\" and \"national security\". In particular, it asks if the process by which danger is identified by national communities are unquestionable and self-evident, or if they are historically contingent and mutable. In this regard, is \"danger\" constructed to foster national solidarity and identity? This course examines different cultural and political texts attesting to the changing nature of the national security community, and uses them as the basis of teaching the elements of essay writing."
  },
  {
    "value": "NTW2019",
    "label": "NTW2019 The Politics And Rhetoric Of Green",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "Increasingly, discussion regarding the debate over the “global war on global warming” presents us with a number of unsettled questions regarding the interplay of science, politics, and personal morality. This course focuses closely on the contemporary debates regarding “green” policy and lifestyle as a way of examining the broader phenomenon of public advocacy and resistance discourse per se – i.e., on disputants’ various ways of speaking about, and attempting to get others to think about, issues of mutual importance. In so doing, students will learn the skills of analytical argument and expository writing necessary for their own successful participation in such debates."
  },
  {
    "value": "NTW2020",
    "label": "NTW2020 Technologies of Home",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "Domestic life is routinely held up for admiration as pure or natural. But how many of us experience family time/space in that way? Challenging the truism that domesticity offers a refuge from the modern world, this course recognises that technology makes it possible for modern people to be, and feel, at home. Some relevant technologies involve engines or electronics. But others organise ideas about gender, room, place and belonging. By enhancing awareness of domesticity’s “constructed nature,” this course deepens understanding of home sweet home."
  },
  {
    "value": "NTW2021",
    "label": "NTW2021 Language, Culture and 'Native' Peoples",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "Depictions of ‘natives’, ‘primitives’ and ‘savages’ abound in the popular cultures of developed countries worldwide. In this course we will examine common stereotypes of native people and primitive cultures to uncover the underlying ideologies driving them, and analyze what cultural purpose such stereotypes serve in modern day life. We will seek to discern what palpable differences exist between primitive and modern people, and to confront the cultural and ethical conundrums entailed by those differences. Finally, we will explore how primitive people view modern society, and assess what the future may hold for native cultures in our fast globalizing world."
  },
  {
    "value": "NTW2023",
    "label": "NTW2023 The Idea of the University",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This course teaches writing and critical thinking through a critical exploration of the nature of the university as an institution. Topics discussed include the many social roles of the university, the history of the university as a contested space in Singapore, and the effects of globalization and transnational education markets on contemporary tertiary education. The course thus provides the chance for students to gain a critical awareness of the nature their own educational experiences, to contextualise them both locally and internationally, and to explore the possible futures of learning communities of which they are a part."
  },
  {
    "value": "NTW2024",
    "label": "NTW2024 Issues in and Around Justice",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This course teaches writing and critical thinking by introducing students to the assumptions that inform, and the arguments for, different concepts and practices of justice. Students will engage topics such as human rights, the place and limits of legal institutions, justifications for civil disobedience, and whether violence is justified in the pursuit of justice. This course enables students to think critically about theories of justice and how these theories shape the pursuit of justice in political life."
  },
  {
    "value": "NTW2026",
    "label": "NTW2026 Religion in Public Life",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "Religion in Public Life concerns the intersection of religion and society and the role of religion in the officially secular state of Singapore. Students will study how religion is discussed in both academic and popular literatures and examine how religious organizations present themselves in order to participate in discussions of social, political or economic importance. The course will include a fieldwork component that will provide students with the data needed to write meaningful research papers based on real sites in Singapore. As a WCT Course, this course will give students the skills to produce rhetorically effective academic writing."
  },
  {
    "value": "NTW2027",
    "label": "NTW2027 What is Wisdom?",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "The University Scholars Program aims to be a “community of people who are curious, critical, courageous, and engaged”. Although we rarely think of it in this way, an older tradition would call such qualities aspects of wisdom. In this course, we will study the concept of wisdom from different disciplinary angles, ranging from philosophy to neurobiology and cultural studies. We will discuss key aspects of wisdom such as judgment and self-transcendence, study how wisdom can be developed, and consider how it might be relevant in professional life or even help to solve world problems."
  },
  {
    "value": "NTW2028",
    "label": "NTW2028 The Social Life of Science",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This course explores how science, as a fundamentally human endeavor, is shaped by the social contexts in which it is practiced. Students will study the social production, circulation, and uptake of scientific knowledge through a series of case studies drawn from the interdisciplinary field of Science and Technology Studies. Students will gain an appreciation of the social processes scientists rely upon to arrive at truths and how scientific ideas and techniques transform once publically circulated. The course will culminate in individual research projects analysing the social contours and consequences of current scientific debates."
  },
  {
    "value": "NTW2029",
    "label": "NTW2029 Evolutionary Psychology and Art",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "Although we enjoy watching movies, reading novels, and listening to music, we might think that these are not very productive ways to spend our time. Yet every society throughout history has devoted significant resources to creating and enjoying art. Why is this the case? Some scholars have proposed that there is an evolved, biological \"human nature\" that can help explain why people are psychologically inclined to create and consume art, particularly art that tells stories. This course will teach students to write effective arguments through discussing and evaluating theories that use evolutionary psychology to understand art."
  },
  {
    "value": "NTW2031",
    "label": "NTW2031 Equity and Education",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This course teaches writing and critical thinking by exploring questions about an activity all students are immersed in: education. It is one of the main ways of acquiring knowledge, it shapes the frameworks with which new information is processed, and it leads to improved qualities of life. We discuss the goals of education, the nature of education, and how education intersects with inequality. This course gives students the ability to critically reflect on their own educational goals, apply useful epistemological concepts to their own experiences, and interrogate beliefs about the role education does and should play in our society."
  },
  {
    "value": "NTW2032",
    "label": "NTW2032 The Self in Health and Longevity",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "How does our conception of personal identity shape our understanding of health and longevity? This course will teach students how to read, think, and write critically through discussions in philosophy, medicine, and technology. We will explore what it is to be a person and what it takes to be the same person over time. Our views about our identity will shape our attitudes towards our health and intuitions about puzzles of personal identity that arise in medical practice. Our attitudes towards personal identity and health go on to determine how far we will go in the pursuit of longevity."
  },
  {
    "value": "NTW2033",
    "label": "NTW2033 Conceptions of Human Nature",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "What is human nature like, and can knowledge of it tell us how to live? In this course we hone our ability to read, think, and write critically by exploring these questions from the perspectives of philosophy, biology, psychology, and anthropology. We discuss and compare influential historical and contemporary conceptions of human nature and investigate their potential implications for our well-being, social organization, morality, and self-understanding. We thus critically reflect on (i) how such conceptions underlie public policy, moral norms, and scientific inquiry, and (ii) how our own conception of human nature shapes our beliefs and lived experience."
  },
  {
    "value": "NTW2034",
    "label": "NTW2034 Wild and Simple: Living and Thinking Sustainably",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This course teaches academic writing and critical thinking skills through a consideration of questions about the environment, including: Do we need to make radical changes to our values in response to the environmental crisis? How about to our lifestyles? And how can we teach people, both adults and young people, to better care for the environment? This course focuses on the question of deep changes to environmental values and lifestyles in developed countries: whether such changes are necessary, and on how they may be effected through policy and education."
  },
  {
    "value": "NTW2035",
    "label": "NTW2035 Art and the Attention Economy",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "We live in an era where information is abundant and distractions are rife; consequently, attention is treated as a scarce resource or commodity. The artworld has responded to this “attention economy” by drawing our attention with controversy, spectacular artworks, and interactive technologies. Are these innovations a capitulation to the glib aesthetics of our social-media-obsessed era, or do they represent exciting and meaningful ways of creating, sharing, and engaging with art? In this course, students consider how the attention economy has transformed the way art is being produced, promoted, consumed, and valued, while learning fundamental research and academic writing skills."
  },
  {
    "value": "NTW2036",
    "label": "NTW2036 Space, Place and the Human Experience",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This course teaches writing and critical thinking by exploring the topic of space. We will interrogate scholarly debates that have been posed across multiple disciplines: what is space, and how does it shape our identities and interpersonal relationships? How are different communities’ access to space structured by social and political institutions? And how does the emergence of virtual reality technologies complicate our relationship to physical space? By the end of this course, students will learn to formulate educated opinions of their own, and express their arguments in the form of a clearly written academic essay."
  },
  {
    "value": "NTW2037",
    "label": "NTW2037 Absences: Beyond the Edges of the Material World",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This course teaches academic writing and critical thinking skills by examining the importance of absences, such as holes, gaps, and shadows, as studied from a range of disciplinary perspectives. We begin by exploring a selection of topics where absences seem to play an important role in a specific domain of inquiry or activity, such as art, human cognition, and justice. Then we consider whether we are right to treat such phenomena as genuine parts of the world, or whether a conception of the world which contains only material objects can provide an adequate understanding of the subject areas in question."
  },
  {
    "value": "NTW2038",
    "label": "NTW2038 Screening Historical Trauma",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This course will examine the interdisciplinary and multimodal discourse on trauma, and it will ask what is at stake in articulating the horrors of history and their lasting impact on communities. Towards that end, we will read texts across multiple academic disciplines alongside cinematic representations. Finally, as a writing course, students will develop critical reading practices and media literacy skills to contribute to this conversation through their own interdisciplinary and multimodal compositions, which will include analytical, argumentative, and research writing as well as a short videographic essay."
  },
  {
    "value": "NTW2039",
    "label": "NTW2039 Videogame Theory and Analysis",
    "canSU": "False",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This course teaches students how to write academic analyses of videogames from a media studies perspective. Our focus will be analyzing how videogames generate player experiences. We will first learn theories about aspects of videogames such as gameplay, narrative, and aesthetics. With these theories, we will try to explain how videogames achieve their effects, discuss criteria for evaluating videogames, and analyze concepts central to game studies. Students will learn to appreciate the unique capacities of videogames as a distinct medium, the elements they share with other media, and frameworks for understanding their effects on players."
  },
  {
    "value": "NHS2010",
    "label": "NHS2010 From Lab to Stage: Writing the Science Play",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "How do we turn science into art? This creative writing course examines how theatre explores issues of science - - the personal, institutional and social dimensions of scientific inquiry – as students create new original dramatic works. Students read and analyse science plays from a playwright’s perspective, and apply the techniques learned to their own short weekly creative writing exercises based on scientific developments. These will be critiqued by their peers, and will culminate in the research and writing of their own one-act plays."
  },
  {
    "value": "NHS2001",
    "label": "NHS2001 Representing War",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "War is the greatest common, man-made trauma that human beings undergo. We imagine war before, during and after we fight it. We imagine it socially, as tribes or nations, generating a common understanding through books, movies, songs and other representations. Those shared visions of war enable us to fight it and confront its trauma. This course examines the changing imagination of war across history. Focusing mainly on English-speaking cultures, it examines poems, books, films, songs, plays, news reports, letters, speeches and tv programmes. It asks how they represent war, and how representations change over time and under pressure from technology, events and political thought."
  },
  {
    "value": "NHS2002",
    "label": "NHS2002 Understanding Irony",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "This course aims to provide students with an introduction to irony, a central term in literary and cultural studies. Irony presupposes disjunctions – between what is said and what is meant, what is perceived and what is real. It thus involves a critical attitude in exploiting and/or perceiving disjunctions. It is often directed with negative effect towards figures and structures of authority, and is sometimes an integral part of a world-view. Students will engage closely with a variety of texts of different types, including poems, tracts, short stories, speeches, plays, sketches, songs and pictures. In doing so, they will reach a better understanding of the roles irony can play not only in literature, but also in society more generally. Since the texts are drawn from different historical times, media and geographical locations, students will get a sense of the widespread use of irony in culture and society."
  },
  {
    "value": "NHS2003",
    "label": "NHS2003 The Subject of Reading",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "Where does meaning come from? Some people think that it resides in the text; some suggest that it originates from the author; others argue that meaning is created by the reader. This course examines the possibilities and problems of the last answer. To what extent does the reader of a text determine its meaning? Is there a universal, objective reader, or are readers historically specific, biased and always \"subjects\"? If a reader constructs the text, can the text in turn construct the reader? We will think about these questions by operating on several levels: (1) by discussing literature and films that thematise reading; (2) by assessing how thinkers have debated the reader's role; and (3) by examining our own processes of reading."
  },
  {
    "value": "NHS2006",
    "label": "NHS2006 Close Reading and Its Vicissitudes",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "What are the possibilities and problems of “close reading”? Close reading has long been a foundational tool in, and beyond, literary studies. By looking at its formalist manifestations and political uses, this course first explores what close reading is. We then discuss recent critiques, which has led to alternatives such as: distant reading; reparative reading; surface reading; thin description; just reading; and too-close reading. In so doing, the course raises bigger questions about the “proper function” of analysis. Should it expose and uncover, or “merely” describe? To make small claims (about a literary work), or large ones (e.g., about society)?"
  },
  {
    "value": "NHS2013",
    "label": "NHS2013 Imagining Animals",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "How have artists, philosophers, and writers of fiction imagined the relation between humans and animals? Have they imagined humans as a species of animal, or as belonging to a realm of being that exceeds the lives of animals? What, if anything, distinguishes us from animals: language, clothing, reason, or something else? In this course we will examine some of the ways these questions have been explored in art, advertising, philosophy, and literature. Students will consider how we look at animals, read the views of influential philosophers, and immerse themselves in literary texts that imagine animals. The course will conclude with an examination of a provocative text by the novelist J. M. Coetzee, who stages a confrontation between philosophy and literature on the question of imagining animals."
  },
  {
    "value": "NHS2016",
    "label": "NHS2016 Technologies of the Self: from Socrates to Self-Help",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "In this course, we will study technologies of the self, practices that individuals adopt in order to transform themselves in light of their ideals. We will look at the origins of this concept in the study of ancient Greek and Roman philosophy and discuss texts drawn from Western and Eastern traditions that recommend particular practices of self-transformation. Throughout the course, we will also consider whether ancient technologies of the self are still relevant today and to what extent contemporary selfimprovement approaches and forms of digital selffashioning are modern examples of technologies of the self or a qualitatively different phenomenon."
  },
  {
    "value": "NHS2017",
    "label": "NHS2017 Making Sense of Colonial Ideology and Its Legacies",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "The rule of Britain, France and the Netherlands in the 18th-20th centuries have left behind a conflicting legacy in different parts of Asia. On the one hand, they destroyed—even if only partially—the cultural traditions as well as socio-economic infrastructure of their colonies. On the other, they established political, economic, social and cultural institutions that colonialized subjects have to different degrees benefitted from till this day. This course will examine how this conflicting legacy came about, so that students will be more analytically equipped in making sense of it."
  },
  {
    "value": "NHS2018",
    "label": "NHS2018 Multidisciplinary Inquiries Into the Mystery Of \"Minds\"",
    "canSU": "True",
    "passFail": "False",
    "hasGroupProject": "False",
    "GEPillar": "GEX",
    "hasMCQ": "False",
    "desc": "What is “the mind” and where does it fit in the interdependent histories of nature and culture on our planet? Does “mind” reduce to brain activity – or is it more than just the electro-chemical exchange between neurons? As minded creatures with brains ourselves, the ways in which we delimit the mind/brain relation has enormous consequences for the ongoing construction of our legal, social, medical and ethical lives. In this course, we will study some of the major approaches to this issue, and attempt to discover what it is that we are really talking about when we are talking about “mind.”"
  }
]